backend/app/models/pending_order.rb

  def line_items
    items = pending_order_items.includes(:product, :product_variant).to_a
    if product.present? && quantity.present? && variant_selected_if_required?
      current = PendingOrderItem.new(pending_order: self, product: product, product_variant: product_variant, quantity: quantity)
      existing = items.find { |item| item.product_id == current.product_id && item.product_variant_id == current.product_variant_id }
---
SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1