backend/app/services/conversation_message_processor.rb

UPDATE "pending_orders" SET "customer_name" = 'Khaled Ahmed', "status" = 3, "updated_at" = '2026-06-06 19:20:47.161395' WHERE "pending_orders"."id" = 5
---
  def apply_action_plan
    plan = ConversationActionPlanner.new(
      message: message,
      business: pending_order.conversation.business,
      current_product: pending_order.product
    ).call
    return false unless plan.actionable?

    product = plan.product || pending_order.product
    variant = plan.variant
    return false if product.blank?
    return false if product.available_variants.any? && variant.blank?

    inventory = variant || product
    if plan.quantity.present? && !inventory.available_for_quantity?(plan.quantity)
      @outcome = :quantity_unavailable
      return true
    end

    attributes = { product: product, product_variant: variant }
    attributes[:quantity] = plan.quantity if plan.quantity.present?
    checkout_details = trustworthy_planned_checkout_details
    attributes.merge!(checkout_details)
    attributes[:status] = next_planned_status(product, variant, plan.quantity, checkout_details)
    pending_order.update!(attributes)