backend/app/services/customer_message_recorder.rb

UPDATE "conversations" SET "last_message_at" = '2026-06-06 19:36:45.303163', "updated_at" = '2026-06-06 19:36:45.303275' WHERE "conversations"."id" = 7
INSERT INTO "conversations" ("external_customer_id", "channel", "status", "last_message_at", "created_at", "updated_at") VALUES ('messenger-smoke-1780774605', 'facebook', 0, NULL, '2026-06-06 19:36:45.301349', '2026-06-06 19:36:45.301349') RETURNING "id"
INSERT INTO "messages" ("conversation_id", "sender_type", "content", "metadata", "created_at", "updated_at") VALUES (7, 1, 'Great choice. How many bottles of Fresh Musk would you like?', '{}', '2026-06-06 19:36:45.326678', '2026-06-06 19:36:45.326678') RETURNING "id"
---
  def record
    conversation = nil
    message = nil
    bot_reply = nil
    pending_order = nil
    outcome = nil
    interpretation = nil
    response_plan = nil

    Conversation.transaction do
      conversation = find_or_create_conversation
      conversation.update!(last_message_at: Time.current)
      message = conversation.messages.create!(
        sender_type: :customer,
        content: content,
        metadata: metadata
      )