backend/app/controllers/conversations_controller.rb

  def lookup
    return render_missing_lookup_params if lookup_params_missing?

    conversation = requested_business.conversations
      .includes(:messages, pending_orders: :product)
      .find_by(channel: params[:channel], external_customer_id: params[:external_customer_id])

    if conversation.present?
---
SELECT "conversations".* FROM "conversations" WHERE "conversations"."channel" = 'facebook' AND "conversations"."external_customer_id" = 'lookup-smoke-1780773833' LIMIT 1
SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = 6

  def serialize_conversation(conversation)
    {
      id: conversation.id,
      channel: conversation.channel,
      external_customer_id: conversation.external_customer_id,
      status: conversation.status,
      last_message_at: conversation.last_message_at&.iso8601,
      conversation_state: conversation.conversation_state,
      messages: conversation.messages.order(:created_at, :id).map { |message| serialize_message(message) },
      pending_order: serialize_pending_order(conversation.pending_order)
---
SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = 6 ORDER BY "messages"."created_at" ASC, "messages"."id" ASC