backend/app/controllers/conversation_messages_controller.rb

UPDATE "conversations" SET "last_message_at" = $1, "updated_at" = $2 WHERE "conversations"."id" = $3  [["last_message_at", "2026-06-06 19:08:27.556590"], ["updated_at", "2026-06-06 19:08:27.556693"], ["id", 29]]
INSERT INTO "conversations" ("channel", "created_at", "external_customer_id", "last_message_at", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "messages" ("content", "conversation_id", "created_at", "metadata", "sender_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "I want Fresh Musk"], ["conversation_id", 30], ["created_at", "2026-06-06 19:08:27.585704"], ["metadata", "{}"], ["sender_type", 0], ["updated_at", "2026-06-06 19:08:27.585704"]]
INSERT INTO "pending_orders" ("address", "conversation_id", "created_at", "customer_name", "phone", "product_id", "quantity", "status", "updated_at", "woo_commerce_order_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    conversation = find_or_create_conversation
    message = nil
    bot_reply = nil
    pending_order = nil

    Conversation.transaction do
      conversation.update!(last_message_at: Time.current)
      message = conversation.messages.create!(sender_type: :customer, content: message_params[:content])
      pending_order = conversation.pending_order || conversation.create_pending_order!

SELECT "conversations".* FROM "conversations" WHERE "conversations"."channel" = $1 AND "conversations"."external_customer_id" = $2 LIMIT $3  [["channel", "facebook"], ["external_customer_id", "fb-user-123"], ["LIMIT", 1]]
---
  def find_or_create_conversation
    Conversation.find_or_create_by!(
      channel: message_params[:channel],
      external_customer_id: message_params[:external_customer_id]
    )