backend/app/controllers/conversations_controller.rb

  def lookup
    return render_missing_lookup_params if lookup_params_missing?

    conversation = requested_business.conversations
      .includes(:messages, pending_orders: :product)
      .find_by(channel: params[:channel], external_customer_id: params[:external_customer_id])

    if conversation.present?
---
SELECT "conversations".* FROM "conversations" WHERE "conversations"."channel" = $1 AND "conversations"."external_customer_id" = $2 LIMIT $3  [["channel", "facebook"], ["external_customer_id", "missing-user"], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = $1 ORDER BY "messages"."created_at" ASC, "messages"."id" ASC  [["conversation_id", 209]]