backend/app/controllers/conversation_messages_controller.rb

UPDATE "conversations" SET "last_message_at" = '2026-06-06 19:18:18.905023', "updated_at" = '2026-06-06 19:18:18.905134' WHERE "conversations"."id" = 4
INSERT INTO "conversations" ("external_customer_id", "channel", "status", "last_message_at", "created_at", "updated_at") VALUES ('manual-smoke-user', 'facebook', 0, NULL, '2026-06-06 19:09:00.693275', '2026-06-06 19:09:00.693275') RETURNING "id"
INSERT INTO "messages" ("conversation_id", "sender_type", "content", "metadata", "created_at", "updated_at") VALUES (4, 0, 'I want Fresh Musk', '{}', '2026-06-06 19:18:18.912939', '2026-06-06 19:18:18.912939') RETURNING "id"
INSERT INTO "pending_orders" ("conversation_id", "product_id", "quantity", "customer_name", "phone", "address", "status", "woo_commerce_order_id", "created_at", "updated_at") VALUES (4, NULL, NULL, NULL, NULL, NULL, 0, NULL, '2026-06-06 19:18:18.920328', '2026-06-06 19:18:18.920328') RETURNING "id"
INSERT INTO "messages" ("conversation_id", "sender_type", "content", "metadata", "created_at", "updated_at") VALUES (4, 1, 'Great choice. How many bottles of Fresh Musk would you like?', '{}', '2026-06-06 19:18:18.928118', '2026-06-06 19:18:18.928118') RETURNING "id"
---
  def create
    conversation = find_or_create_conversation
    message = nil
    bot_reply = nil
    pending_order = nil

    Conversation.transaction do
      conversation.update!(last_message_at: Time.current)
      message = conversation.messages.create!(sender_type: :customer, content: message_params[:content])
      pending_order = conversation.pending_order || conversation.create_pending_order!
      ConversationMessageProcessor.new(message: message, pending_order: pending_order).process
      bot_reply = conversation.messages.create!(
        sender_type: :bot,
        content: BotReplyGenerator.new(pending_order: pending_order).content
      )

INSERT INTO "conversations" ("external_customer_id", "channel", "status", "last_message_at", "created_at", "updated_at") VALUES ('reply-smoke-1780773498', 'facebook', 0, NULL, '2026-06-06 19:18:18.902409', '2026-06-06 19:18:18.902409') RETURNING "id"
SELECT "conversations".* FROM "conversations" WHERE "conversations"."channel" = 'facebook' AND "conversations"."external_customer_id" = 'reply-smoke-1780773498' LIMIT 1
---
  def find_or_create_conversation
    Conversation.find_or_create_by!(
      channel: message_params[:channel],
      external_customer_id: message_params[:external_customer_id]
    )