backend/app/controllers/products_controller.rb

  def index
    products = business.products.active.in_stock.order(:name)

    render json: products.map { |product| serialize_product(product) }
---
SELECT "products".* FROM "products" WHERE "products"."active" = $1 AND (stock_quantity > 0) ORDER BY "products"."name" ASC  [["active", true]]
SELECT "products".* FROM "products" WHERE "products"."active" = $1 AND (stock_quantity > 0)  [["active", true]]

  def create
    product = business.products.create!(product_params)
---
INSERT INTO "products" ("active", "created_at", "description", "name", "price", "stock_quantity", "tags", "updated_at", "woo_commerce_product_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"