backend/app/controllers/products_controller.rb

  def index
    products = business.products.active.in_stock.order(:name)

    render json: products.map { |product| serialize_product(product) }
---
SELECT "products".* FROM "products" WHERE "products"."active" = TRUE AND (stock_quantity > 0) ORDER BY "products"."name" ASC

  def create
    product = business.products.create!(product_params)
---
INSERT INTO "products" ("name", "woo_commerce_product_id", "price", "stock_quantity", "description", "tags", "active", "created_at", "updated_at") VALUES ('The Party', NULL, 999.0, 10, 'A modern, vibrant scent with bold and sweet energy. Expressive and confident, made for standout moments.', 'party,sweet,vibrant,bold,evening', TRUE, '2026-06-06 20:03:44.651279', '2026-06-06 20:03:44.651279') RETURNING "id"